Include("\\script\\skill\\head.lua")
-----------------------------------------------
SKILLS = {

	addskillvip4 = {
		lifemax_yan_v={{{1,107},{20,15149}},{{1,-1},{2,-1}}},			--T¨ng Sinh Lùc
		manamax_yan_v={{{1,107},{20,15149}},{{1,-1},{2,-1}}}, 			--T¨ng Néi Lùc
		skill_enhance={{{1,40},{2,40}},{{1,-1},{2,-1}}}, 			--T¨ng C«ng KÝch
		allres_yan_p={{{1,25},{2,25}},{{1,-1},{2,-1}}}, 				--Kh¸ng TÊt C¶
                returnres_p={{{1,5},{40,15},{41,15}},{{1,-1},{20,-1}}},--Ôö¼Ó¶Ô·´µ¯ÉËº¦µÄ¿¹ÐÔ£¬Ã¿¼¶1%£¬ÉÏÏÞ40%
	},
	addskillvip5 = {
		
		lifemax_yan_v={{{1,107},{20,10149}},{{1,-1},{2,-1}}}, 			--T¨ng Sinh Lùc
		manamax_yan_v={{{1,107},{20,10149}},{{1,-1},{2,-1}}},			--T¨ng Néi Lùc
		skill_enhance={{{1,30},{2,30}},{{1,-1},{2,-1}}}, 			--T¨ng C«ng KÝch
		allres_yan_p={{{1,20},{2,20}},{{1,-1},{2,-1}}}, 				--Kh¸ng TÊt C¶
                returnres_p={{{1,5},{40,12},{41,12}},{{1,-1},{20,-1}}},--Ôö¼Ó¶Ô·´µ¯ÉËº¦µÄ¿¹ÐÔ£¬Ã¿¼¶1%£¬ÉÏÏÞ40%
	},
	addskillvip6 = {
		
		lifemax_yan_v={{{1,107},{20,9149}},{{1,-1},{2,-1}}},			--T¨ng Sinh Lùc
		manamax_yan_v={{{1,107},{20,9149}},{{1,-1},{2,-1}}},			--T¨ng Néi Lùc
		skill_enhance={{{1,25},{2,25}},{{1,-1},{2,-1}}}, 			--T¨ng C«ng KÝch
		allres_yan_p={{{1,15},{2,15}},{{1,-1},{2,-1}}}, 				--Kh¸ng TÊt C¶
                returnres_p={{{1,1},{40,10},{41,10}},{{1,-1},{20,-1}}},--Ôö¼Ó¶Ô·´µ¯ÉËº¦µÄ¿¹ÐÔ£¬Ã¿¼¶1%£¬ÉÏÏÞ40%
	},
	addskillvip7 = {
		
		lifemax_yan_v={{{1,107},{20,5149}},{{1,-1},{2,-1}}}, 			--T¨ng Sinh Lùc
		manamax_yan_v={{{1,107},{20,5149}},{{1,-1},{2,-1}}}, 			--T¨ng Néi Lùc
		skill_enhance={{{1,20},{2,20}},{{1,-1},{2,-1}}}, 			--T¨ng C«ng KÝch
		allres_yan_p={{{1,10},{2,10}},{{1,-1},{2,-1}}}, 				--Kh¸ng TÊt C¶
                returnres_p={{{1,5},{40,7},{41,7}},{{1,-1},{20,-1}}},--Ôö¼Ó¶Ô·´µ¯ÉËº¦µÄ¿¹ÐÔ£¬Ã¿¼¶1%£¬ÉÏÏÞ40%
	},
	addskillvip8 = {
		
		lifemax_yan_v={{{1,107},{20,2149}},{{1,-1},{2,-1}}},			--T¨ng Sinh Lùc
		manamax_yan_v={{{1,107},{20,2149}},{{1,-1},{2,-1}}},			--T¨ng Néi Lùc
		skill_enhance={{{1,10},{2,10}},{{1,-1},{2,-1}}}, 			--T¨ng C«ng KÝch
		allres_yan_p={{{1,5},{2,5}},{{1,-1},{2,-1}}}, 				--Kh¸ng TÊt C¶
              returnres_p={{{1,5},{40,4},{41,4}},{{1,-1},{20,-1}}},--Ôö¼Ó¶Ô·´µ¯ÉËº¦µÄ¿¹ÐÔ£¬Ã¿¼¶1%£¬ÉÏÏÞ40%
	},
	    addskillvip9 = {
	 	lifemax_yan_v={{{1,107},{20,9149}},{{1,-1},{2,-1}}},			--T¨ng Sinh Lùc
		manamax_yan_v={{{1,107},{20,9149}},{{1,-1},{2,-1}}},			--T¨ng Néi Lùc
		skill_enhance={{{1,90},{2,90}},{{1,-1},{2,-1}}}, 			--T¨ng C«ng KÝch
		allres_yan_p={{{1,40},{2,40}},{{1,-1},{2,-1}}}, 				--Kh¸ng TÊt C¶
                returnres_p={{{1,5},{40,100},{41,100}},{{1,-1},{20,-1}}},--Ôö¼Ó¶Ô·´µ¯ÉËº¦µÄ¿¹ÐÔ£¬Ã¿¼¶1%£¬ÉÏÏÞ40%
                sorbdamage_yan_p={{{1,150},{40,150}},{{1,-1},{10,-1}}},
	},
        addskillvip10 = {
                attackratingenhance_p={{{1,3000},{30,3000}},{{1,18*120},{30,18*360}}},
	 	lifemax_yan_v={{{1,107},{20,5149}},{{1,-1},{2,-1}}},			--T¨ng Sinh Lùc
		manamax_yan_v={{{1,107},{20,5149}},{{1,-1},{2,-1}}},			--T¨ng Néi Lùc
		skill_enhance={{{1,120},{2,120}},{{1,-1},{2,-1}}}, 			--T¨ng C«ng KÝch
		allres_yan_p={{{1,150},{2,150}},{{1,-1},{2,-1}}}, 				--Kh¸ng TÊt C¶
                returnres_p={{{1,100},{40,100}},{{1,-1},{20,-1}}},--Ôö¼Ó¶Ô·´µ¯ÉËº¦µÄ¿¹ÐÔ£¬Ã¿¼¶1%£¬ÉÏÏÞ40%
                sorbdamage_yan_p={{{1,30},{40,30}},{{1,-1},{10,-1}}},
	},
         addskillvip11 = {
               enhancehit_rate={{{1,0},{9,20},{14,20}},{{1,-1},{2,-1}}},
		anti_block_rate={{{1,0},{9,20},{14,20}},{{1,-1},{2,-1}}},
                returnres_p={{{1,200},{40,200}},{{1,-1},{20,-1}}},--Ôö¼Ó¶Ô·´µ¯ÉËº¦µÄ¿¹ÐÔ£¬Ã¿¼¶1%£¬ÉÏÏÞ40%
                sorbdamage_yan_p={{{1,200},{40,200}},{{1,-1},{10,-1}}},
	},

}
