-- script viet hoa By http://tranhba.com ##±±Ä### ###Ì## ¢#Ì#20#ß###¤#° £µ##Ì###

function main(sel)

-- script viet hoa By http://tranhba.com UTask_world36 = GetTask(64);

if (UTask_world36 == 0) then 
Talk(3, "select", "#ß###º°#####", "######¤â·´¤óâ©°#Ðï×####Ä#¿", "#ß###º¿´Ä·£#Ý©##µ´#Ä°Ð##·######ï###°#Ä##£#¢ð#¿â©##××³¯Ý#ÅÐ£µ·#£#´ãÌ#µ´£ã²×###ïã##ß####²#Ä#Ð####ß×#####£#ã#°#£#Ìý##Ä·##â©£µ·#£#´ãÌ#£ã²×#ó°³·#â©##ß####Äã#£²·´######â©##××##²#³ÐÐóß©##°³ß##ß´ã##¿Ð¤â·´#ý°###")
return
end;

-- script viet hoa By http://tranhba.com if (UTask_world36 == 1) then 
Say("#ß###º¿´Ä·£#Ý©##µ´#Ä°Ð##·######ï###°#Ä##£#¢ð#¿â©##××³¯Ý#ÅÐ£µ·#£#´ãÌ#µ´£ã²×###ïã##ß####²#Ä#Ð####ß×#####£#ã#°#£#Ìý##Ä·##â©£µ·#£#´ãÌ#£ã²×#ó°³·#â©##ß####Äã#£²·´######â©##××##²#³ÐÐóß©##°³ß##ß´ã##¿Ð¤â·´#ý°###", 0)
-- script viet hoa By http://tranhba.com end;

end;


function select()
Say("¿´####¿Ð¸¯#Ä####", 2, "####/accept", "²#####/refuse");
end;


function accept()

if (GetCash() > 1000) then							-- script viet hoa By http://tranhba.com ²#¿###
	Talk(2, "select1", "#######ßâ©µ#ã###ß##ã##Ä·#ÌÄ·Ì##Ì#Ì#±##", "#ß###º°³¸######µ#ª##Ä·#Ý###ßâ©·´#µß##ã##â#£#ß###â×ß##ÄÌ###â©·´#Å°Ð###ß##Ì#ß¤#ß×###Ðó####£#¿´##Ì####ÛÐ###ß²#·ã#²#ÐïÅ###º##Ä###Ð¸####Ý´###Ä·ß###ã·µ´#µÐÝ°Ð##")	
else
	Say("#ß###º¿´µ´Ä·ß²²###¤#°#####£##·¸#°Ð##Ä·#Äº·ß©#ß#Ä¸×¸###", 0)
end;

end;


function refuse()
end;


function select1()
Pay(GetCash()/3)
AddOwnExp(1000)	
SetTask(64, 1)
end;
